# Data Transformations in Pandas
#### by Sukritha Joshi

In [1]:
# importing required libraries
import numpy as np
import pandas as pd

In [2]:
# creating a students datframe
df_students = pd.DataFrame(['Sarah', 'Daniel', 'Smitha', 'Kiran', 'Hailey'], columns=['student names'])
df_students

  student names
0         Sarah
1        Daniel
2        Smitha
3         Kiran
4        Hailey

In [3]:
# creating a table with random values for scores of students
df_scores = (pd.DataFrame(np.random.uniform(low=0, high=10, size=(5,3)), columns=['Test1', 'Test2', 'Test3'])).round(2)
df_scores

   Test1  Test2  Test3
0   7.59   8.33   5.31
1   1.58   9.46   7.88
2   5.86   8.29   5.45
3   4.81   9.00   4.83
4   5.75   7.01   4.35

In [4]:
# combining the 2 dataframes to form a final dataset
df = pd.concat([df_students, df_scores], axis=1)
df

  student names  Test1  Test2  Test3
0         Sarah   7.59   8.33   5.31
1        Daniel   1.58   9.46   7.88
2        Smitha   5.86   8.29   5.45
3         Kiran   4.81   9.00   4.83
4        Hailey   5.75   7.01   4.35

In [5]:
# starting the index numbers from 1 instead of 0
df.index = np.arange(1, len(df)+1)

In [6]:
# renaming the name of the column
df = df.rename({'student names':'StudentName'}, axis=1)
df

  StudentName  Test1  Test2  Test3
1       Sarah   7.59   8.33   5.31
2      Daniel   1.58   9.46   7.88
3      Smitha   5.86   8.29   5.45
4       Kiran   4.81   9.00   4.83
5      Hailey   5.75   7.01   4.35

In [7]:
# the school has 3 mid terms, the average of the highest 2 exams is considered as the final grade
# this is a function to calculte the final score of each student

def best_of_3(a, b, c): 
    return max((a+b)/2, (b+c)/2, (c+a)/2)

df['FinalScore'] = df.apply(lambda row : best_of_3(row['Test1'], row['Test2'], row['Test3']), axis = 1)
df['FinalScore'] = df['FinalScore'].round(2)

In [8]:
# viewing the dataframe after adding the new column
df

  StudentName  Test1  Test2  Test3  FinalScore
1       Sarah   7.59   8.33   5.31        7.96
2      Daniel   1.58   9.46   7.88        8.67
3      Smitha   5.86   8.29   5.45        7.07
4       Kiran   4.81   9.00   4.83        6.92
5      Hailey   5.75   7.01   4.35        6.38

In [9]:
# if a student has scored below 4, he/she has failed and will have to re-attempt the class.
# the below dataframe highlights the scores below 4

df.style.applymap(lambda x: "background-color: red" if x<4 else "background-color: ", subset=df.columns[1:5])

In [10]:
# finally let's add a column which explicitly states whether or not a student has passed

def result(FinalScore, StudentName):
    if FinalScore < 4:
        return 'fail'
    else:
        return 'pass'

df['Result'] = df.apply(lambda row : result(row['FinalScore'], row['StudentName']), axis = 1)

In [11]:
df

  StudentName  Test1  Test2  Test3  FinalScore Result
1       Sarah   7.59   8.33   5.31        7.96   pass
2      Daniel   1.58   9.46   7.88        8.67   pass
3      Smitha   5.86   8.29   5.45        7.07   pass
4       Kiran   4.81   9.00   4.83        6.92   pass
5      Hailey   5.75   7.01   4.35        6.38   pass

In [12]:
df.style.applymap(lambda x: "background-color: red" if x=='fail' else "background-color: lime", subset=['Result'])

In [13]:
df.style.applymap(lambda x: "background-color: red" if x=='fail' else "background-color: lime", subset=['Result']).to_excel('Result.xlsx')

### data set 2

In [14]:
df2 = pd.read_csv('student-mat.csv', sep=';')

In [15]:
df2.head()

  school sex  age address  health  absences  G1  G2  G3
0     GP   F   18       U     3.0       6.0   5   6   6
1     GP   F   17       U     3.0       4.0   5   5   6
2     GP   F   15       U     3.0      10.0   7   8  10
3     GP   F   15       U     5.0       2.0  15  14  15
4     GP   F   16       U     5.0       4.0   6  10  10

In [16]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   school    395 non-null    object
 1   sex       395 non-null    object
 2   age       395 non-null    int64
 3   address   378 non-null    object
 4   health    384 non-null    float64
 5   absences  380 non-null    float64
 6   G1        395 non-null    int64
 7   G2        395 non-null    int64
 8   G3        395 non-null    int64
dtypes: float64(2), int64(4), object(3)
memory usage: 27.9+ KB

In [17]:
df2.isnull().sum()

school       0
sex          0
age          0
address     17
health      11
absences    15
G1           0
G2           0
G3           0
dtype: int64

In [18]:
# finding the number of missing records and its percentage

total = df2.isnull().sum().sort_values(ascending=False)
percent = (round((df2.isnull().sum()/df2.isnull().count()*100),1)).sort_values(ascending=False)
missing_data = pd.concat([total, percent], axis=1, keys=['Total', '%'])
missing_data

          Total    %
address      17  4.3
absences     15  3.8
health       11  2.8
G3            0  0.0
G2            0  0.0
G1            0  0.0
age           0  0.0
sex           0  0.0
school        0  0.0

In [19]:
# dropping the null records from health and absences columns since it is a small percentage
df2.dropna(subset=['health', 'absences'], inplace=True)

In [20]:
df2.isnull().sum()

school       0
sex          0
age          0
address     15
health       0
absences     0
G1           0
G2           0
G3           0
dtype: int64

In [21]:
# to handle missing data in address column, we can replace the Nan values with the most frequently occuring category in the column
# this method has a the disadvantage that it may imbalance the dataset

df2.fillna(value = df2['address'].value_counts().idxmax(), inplace=True)

In [25]:
df2.isnull().sum()

school      0
sex         0
age         0
address     0
health      0
absences    0
G1          0
G2          0
G3          0
dtype: int64

                                                    ---x----  end  ----x---